[	{		"Arabic" : "كئيب",		"Arabic_Context" : "إنه يوم dreich.",		"Arabic_Info" : "تستخدم كلمة كئيب لوصف يوم غائم ورطب يوحي بالملل والثقل. قد تمتد دلالتها لتشمل المزاج العام حين يشعر الشخص بالفتور أو الحزن. تستعمل في اللغة اليومية كما في الكتابة الصحفية والأدبية. تعطي انطباعًا قويًا بوجود جوّ بارد ومظلم يطول أمده.",		"English_Context" : "It’s a dreich day.",		"English_Info" : "The word dreich paints a picture of a dull, grey, and damp day. It often carries a sense of weariness or heaviness, beyond just the rain itself. People use it not only for weather but also for moods or situations that feel bleak and uninspiring. It’s a cultural shorthand in Scotland for the kind of weather that gets under your skin.",		"French" : "maussade",		"French_Context" : "C'est une journée dreich.",		"French_Info" : "Le mot maussade décrit une atmosphère grise, sombre et souvent humide. Il s’emploie fréquemment pour parler du temps, mais aussi pour exprimer un sentiment de mélancolie ou de lassitude. C’est un adjectif courant dans les conversations quotidiennes, particulièrement lorsqu’on critique la météo. Il peut également s’utiliser de manière figurée pour décrire une ambiance pesante ou ennuyeuse.",		"Japanese" : "陰鬱な",		"Japanese_Context" : "今日は dreich な日だ。",		"Japanese_Info" : "陰鬱なは、空模様や気分がどんよりとして暗く重い様子を表します。特に曇りや雨の日に使われ、心理的な落ち込みを暗示することもあります。日常会話だけでなく文学や新聞でも見かける言葉です。人や雰囲気を形容するときにも使えます。",		"audioScottish" : "Z003.dreich.scottish.mp3",		"audioScottishContext" : "Z003.dreich.scottishContext.mp3",		"audioScottishSlow" : "Z003.dreich.scottishSlow.mp3",		"context" : "It’s a dreich day.",		"grammarType" : "adjective",		"id" : "Z003",		"ipa" : "/driːx/ ~ /driːç/",		"meaning" : "miserable weather",		"phonetic" : "dreech",		"scottish" : "dreich"	},	{		"Arabic" : "ضجة",		"Arabic_Context" : "كان هناك stoochie كبير في الحفلة.",		"Arabic_Info" : "تعبّر كلمة فوضى عن حالة من الاضطراب أو الضجيج الذي ينشأ في المناسبات الاجتماعية أو الأماكن المزدحمة. قد تستعمل للإشارة إلى مشادة بسيطة أو جدال صاخب، وغالبًا ما تحمل طابعًا عابرًا. تُستخدم في الحياة اليومية وفي الصحافة الشعبية. تعكس إحساسًا بالحركة غير المنظّمة والجو المثير للانتباه.",		"English_Context" : "There was a right stoochie at the party.",		"English_Info" : "Stoochie refers to a noisy fuss or disturbance, usually caused by a group of people. It can be light-hearted, like a lively gathering, or more negative, like a squabble or rowdy argument. The word carries a casual, everyday feel rather than formal tone. It’s the sort of thing you’d hear when describing a party gone out of hand or a street kerfuffle.",		"French" : "chahut",		"French_Context" : "Il y avait un vrai stoochie à la fête.",		"French_Info" : "Chahut renvoie à un grand bruit, désordre ou agitation causée par un groupe de personnes. C’est un mot souvent utilisé pour les scènes d’école, de manifestations ou de fêtes animées. On l’emploie de manière familière et il évoque une ambiance bruyante, parfois chaotique. Dans certains contextes, il peut être positif, synonyme de fête animée, ou négatif, synonyme de désordre incontrôlé.",		"Japanese" : "騒ぎ",		"Japanese_Context" : "パーティーで大きな stoochie があった。",		"Japanese_Info" : "騒ぎは人や集団による大きな音や混乱を表す言葉です。ポジティブに盛り上がっている場面でも、ネガティブに騒動や事件を指す場合もあります。日常会話やニュースでもよく登場する表現です。場の雰囲気や出来事を強調する際に適しています。",		"audioScottish" : "Z004.stoochie.scottish.mp3",		"audioScottishContext" : "Z004.stoochie.scottishContext.mp3",		"audioScottishSlow" : "Z004.stoochie.scottishSlow.mp3",		"context" : "There was a right stoochie at the party.",		"grammarType" : "noun",		"id" : "Z004",		"ipa" : "/ˈstuːʃi/",		"meaning" : "a commotion",		"phonetic" : "stoo-chee",		"scottish" : "stoochie"	},	{		"Arabic" : "نعم",		"Arabic_Context" : "Aye، سأرافقك.",		"Arabic_Info" : "تُستخدم كلمة نعم للإجابة بالإيجاب أو الموافقة في مختلف المواقف. قد تأتي بدرجات مختلفة من الرسمية حسب السياق، من المحادثة اليومية البسيطة إلى المداولات الرسمية. تُعد كلمة أساسية في التواصل اليومي. تحمل أيضًا طابعًا ودودًا عند تكرارها في اللهجات المحكية.",		"English_Context" : "Aye, I’ll come along.",		"English_Info" : "Aye is the standard Scots word for “yes” and one of the most recognizable features of Scottish speech. It is used across all contexts, from casual conversation to more formal agreement. Unlike English “yes,” it often carries a warm, familiar tone that feels rooted in local culture. For learners, it’s one of the easiest and most common Scots words to pick up.",		"French" : "oui",		"French_Context" : "Aye, je viendrai aussi.",		"French_Info" : "Oui est la réponse affirmative la plus simple et la plus courante en français. C’est un mot universel qui fonctionne dans toutes les situations, du langage familier au langage très formel. Sa valeur est constante et il sert aussi bien à donner son accord qu’à exprimer son attention. Son emploi est si fréquent qu’il est l’un des premiers mots appris par les non-francophones.",		"Japanese" : "はい",		"Japanese_Context" : "Aye、私も行きます。",		"Japanese_Info" : "はいは日本語で最も一般的な肯定の表現です。丁寧さや形式に関わらず幅広く使われ、ビジネスシーンから友人同士の会話まで自然に登場します。強く同意を示す場合にも、単純に返事としても使われます。日本語学習者が最初に覚える言葉の一つです。",		"audioScottish" : "Z005.aye.scottish.mp3",		"audioScottishContext" : "Z005.aye.scottishContext.mp3",		"audioScottishSlow" : "Z005.aye.scottishSlow.mp3",		"context" : "Aye, I’ll come along.",		"grammarType" : "interjection",		"id" : "Z005",		"ipa" : "/aɪ/",		"meaning" : "yes",		"phonetic" : "eye",		"scottish" : "aye"	},	{		"Arabic" : "يعرف",		"Arabic_Context" : "هل ken ما الوقت؟",		"Arabic_Info" : "الفعل يعرف يُستخدم للدلالة على إدراك شيء أو امتلاك المعرفة به. قد يأتي في سياق بسيط مثل معرفة الوقت أو المكان، أو في معانٍ أعمق تتعلق بالفهم والوعي. يُستعمل على نطاق واسع في جميع مستويات اللغة العربية. يعكس أهمية فعل المعرفة في الحياة اليومية والثقافة.",		"English_Context" : "Do ye ken what time it is?",		"English_Info" : "Ken is a core Scots verb meaning “to know” or “to be aware of.” It shows up in questions, statements, and idioms, making it highly versatile. The word is deeply embedded in Scottish identity, giving speech a distinctly local flavor. It connects everyday talk to the older Germanic roots shared with other European languages.",		"French" : "savoir",		"French_Context" : "Est-ce que tu ken l'heure qu’il est ?",		"French_Info" : "Savoir est un verbe central du français, utilisé pour exprimer la connaissance d’un fait ou d’une compétence. Il est omniprésent dans la langue et apparaît dans des contextes variés, des discussions informelles aux textes académiques. Son emploi est si fondamental qu’il constitue un pilier grammatical et lexical. C’est un mot incontournable pour toute personne qui apprend le français.",		"Japanese" : "知る",		"Japanese_Context" : "何時か ken ていますか。",		"Japanese_Info" : "知るは知識や情報を持っていることを表す重要な動詞です。人や事実を理解していることを示すときに広く使われます。文学や日常会話、教育現場でも頻繁に登場します。日本語学習においても最初期に学ぶ必須の語です。",		"audioScottish" : "Z006.ken.scottish.mp3",		"audioScottishContext" : "Z006.ken.scottishContext.mp3",		"audioScottishSlow" : "Z006.ken.scottishSlow.mp3",		"context" : "Do ye ken what time it is?",		"grammarType" : "verb",		"id" : "Z006",		"ipa" : "/kɛn/",		"meaning" : "to know",		"phonetic" : "ken",		"scottish" : "ken"	},	{		"Arabic" : "جميلة",		"Arabic_Context" : "إنها فتاة bonnie.",		"Arabic_Info" : "كلمة جميلة تُستخدم لوصف شخص أو منظر يبعث على الإعجاب. قد تأتي بمعانٍ أخرى مثل حسن أو رائع بحسب السياق. تظهر كثيرًا في الشعر والحديث اليومي على حد سواء. تضفي شعورًا بالدفء والتقدير البسيط للجمال.",		"English_Context" : "She’s a bonnie lass.",		"English_Info" : "Bonnie is one of the best-known Scots words and is used to describe beauty in a warm, affectionate way. It often refers to people, especially women or children, but can also describe places, objects, or even feelings. Unlike “beautiful,” which can sound formal or distant, bonnie feels homely and heartfelt. It’s a word that carries cultural weight, appearing in songs, poems, and everyday conversation across Scotland.",		"French" : "jolie",		"French_Context" : "C’est une fille bonnie.",		"French_Info" : "Jolie est un adjectif qui décrit une beauté douce et plaisante, sans exagération. On l’emploie souvent pour parler d’une femme ou d’un objet charmant. Sa nuance est moins intense que beau/belle, ce qui en fait un terme affectueux et accessible. Dans la vie quotidienne, il est extrêmement courant et facilement compris.",		"Japanese" : "きれいな",		"Japanese_Context" : "彼女は bonnie な娘だ。",		"Japanese_Info" : "きれいなは人や物が美しいと感じられることを表す言葉です。フォーマルでもカジュアルでも広く使われ、肯定的な評価を与えます。女性に対する褒め言葉として非常によく登場します。物や風景に対しても自然に使える便利な表現です。",		"audioScottish" : "Z007.bonnie.scottish.mp3",		"audioScottishContext" : "Z007.bonnie.scottishContext.mp3",		"audioScottishSlow" : "Z007.bonnie.scottishSlow.mp3",		"context" : "She’s a bonnie lass.",		"grammarType" : "adjective",		"id" : "Z007",		"ipa" : "/ˈbɔni/",		"meaning" : "pretty",		"phonetic" : "bon-nee",		"scottish" : "bonnie"	}]