[	{		"Arabic" : "كئيب",		"Arabic_Context" : "إنه يوم dreich.",		"Arabic_Info" : "تستخدم كلمة كئيب لوصف يوم غائم ورطب يوحي بالملل والثقل. قد تمتد دلالتها لتشمل المزاج العام حين يشعر الشخص بالفتور أو الحزن. تستعمل في اللغة اليومية كما في الكتابة الصحفية والأدبية. تعطي انطباعًا قويًا بوجود جوّ بارد ومظلم يطول أمده.",		"English_Context" : "It’s a dreich day.",		"English_Info" : "Used frequently in Scotland! Dreich is the perfect description of cold, grey, damp, dreary, drizzly, depressing, weather. It was voted “most iconic Scots word” in a 2004 poll. Dreich has been recorded since the 15th century, from Old Scots drech or dregh, meaning tedious, long-lasting, or slow.",		"French" : "maussade",		"French_Context" : "C'est une journée dreich.",		"French_Info" : "Utilisé fréquemment en Écosse ! Dreich est la description parfaite d’un temps froid, gris, humide, morne, bruineux et déprimant. Le mot a été élu « mot écossais le plus emblématique » lors d’un sondage en 2004. Il est attesté depuis le XVe siècle, issu de l’ancien écossais drech ou dregh, signifiant ennuyeux, de longue durée ou lent.",		"Japanese" : "陰鬱な",		"Japanese_Context" : "今日は dreich な日だ。",		"Japanese_Info" : "陰鬱なは、空模様や気分がどんよりとして暗く重い様子を表します。特に曇りや雨の日に使われ、心理的な落ち込みを暗示することもあります。日常会話だけでなく文学や新聞でも見かける言葉です。人や雰囲気を形容するときにも使えます。",		"audioScottish" : "Z003.dreich.scottish.mp3",		"audioScottishContext" : "Z003.dreich.scottishContext.mp3",		"audioScottishSlow" : "Z003.dreich.scottishSlow.mp3",		"context" : "It’s a dreich day.",		"grammarType" : "adjective",		"id" : "Z003",		"ipa" : "/driːx/ ~ /driːç/",		"meaning" : "miserable weather",		"phonetic" : "dreech",		"scottish" : "dreich"	},	{		"Arabic" : "ضجة",		"Arabic_Context" : "كان هناك stoochie كبير في الحفلة.",		"Arabic_Info" : "تعبّر كلمة فوضى عن حالة من الاضطراب أو الضجيج الذي ينشأ في المناسبات الاجتماعية أو الأماكن المزدحمة. قد تستعمل للإشارة إلى مشادة بسيطة أو جدال صاخب، وغالبًا ما تحمل طابعًا عابرًا. تُستخدم في الحياة اليومية وفي الصحافة الشعبية. تعكس إحساسًا بالحركة غير المنظّمة والجو المثير للانتباه.",		"English_Context" : "There was a right stoochie at the party.",		"English_Info" : "A good old stooshie is a row, commotion or noisy disturbance. A stoochie can vary from a noisy family argument to a full-blown fight. No definite origin of this word, however, it may come from northern English stoush (a fight or scuffle). Spellings vary — stushie, stushy, or stooshie — depending on dialect. Equivalent words; Stramash; Rammy",		"French" : "chahut",		"French_Context" : "Il y avait un vrai stoochie à la fête.",		"French_Info" : "Un bon vieux stooshie est une dispute, une agitation ou un vacarme. Cela peut aller d’une querelle familiale bruyante à une véritable bagarre. L’origine n’est pas certaine, mais il pourrait provenir de l’anglais du Nord stoush (bagarre ou échauffourée). L’orthographe varie — stushie, stushy ou stooshie — selon le dialecte. Mots équivalents : stramash, rammy.",		"Japanese" : "騒ぎ",		"Japanese_Context" : "パーティーで大きな stoochie があった。",		"Japanese_Info" : "騒ぎは人や集団による大きな音や混乱を表す言葉です。ポジティブに盛り上がっている場面でも、ネガティブに騒動や事件を指す場合もあります。日常会話やニュースでもよく登場する表現です。場の雰囲気や出来事を強調する際に適しています。",		"audioScottish" : "Z004.stoochie.scottish.mp3",		"audioScottishContext" : "Z004.stoochie.scottishContext.mp3",		"audioScottishSlow" : "Z004.stoochie.scottishSlow.mp3",		"context" : "There was a right stoochie at the party.",		"grammarType" : "noun",		"id" : "Z004",		"ipa" : "/ˈstuːʃi/",		"meaning" : "a commotion",		"phonetic" : "stoo-chee",		"scottish" : "stoochie"	},	{		"Arabic" : "نعم",		"Arabic_Context" : "Aye، سأرافقك.",		"Arabic_Info" : "تُستخدم كلمة نعم للإجابة بالإيجاب أو الموافقة في مختلف المواقف. قد تأتي بدرجات مختلفة من الرسمية حسب السياق، من المحادثة اليومية البسيطة إلى المداولات الرسمية. تُعد كلمة أساسية في التواصل اليومي. تحمل أيضًا طابعًا ودودًا عند تكرارها في اللهجات المحكية.",		"English_Context" : "Aye, I’ll come along.",		"English_Info" : "Aye is found in everyday speech. Its roots go back to Middle English ay (ever, always), which shifted in Scots. “Yours aye” is a genuine Scots sign-off. Meaning: it’s the Scots equivalent of “Yours always / faithfully”, but with a bit more warmth. Context is everything: “Aye, right!” flips into a sharp dismissal, meaning the exact opposite. ",		"French" : "oui",		"French_Context" : "Aye, je viendrai aussi.",		"French_Info" : "Aye se retrouve dans la langue quotidienne. Ses racines remontent au moyen anglais ay (toujours, à jamais), qui a évolué en écossais. « Yours aye » est une véritable formule de clôture écossaise, équivalent de « à vous toujours / fidèlement », mais avec plus de chaleur. Tout dépend du contexte : « Aye, right ! » devient un rejet ironique, signifiant exactement l’inverse.",		"Japanese" : "はい",		"Japanese_Context" : "Aye、私も行きます。",		"Japanese_Info" : "はいは日本語で最も一般的な肯定の表現です。丁寧さや形式に関わらず幅広く使われ、ビジネスシーンから友人同士の会話まで自然に登場します。強く同意を示す場合にも、単純に返事としても使われます。日本語学習者が最初に覚える言葉の一つです。",		"audioScottish" : "Z005.aye.scottish.mp3",		"audioScottishContext" : "Z005.aye.scottishContext.mp3",		"audioScottishSlow" : "Z005.aye.scottishSlow.mp3",		"context" : "Aye, I’ll come along.",		"grammarType" : "interjection",		"id" : "Z005",		"ipa" : "/aɪ/",		"meaning" : "yes",		"phonetic" : "eye",		"scottish" : "aye"	},	{		"Arabic" : "يعرف",		"Arabic_Context" : "هل ken ما الوقت؟",		"Arabic_Info" : "الفعل يعرف يُستخدم للدلالة على إدراك شيء أو امتلاك المعرفة به. قد يأتي في سياق بسيط مثل معرفة الوقت أو المكان، أو في معانٍ أعمق تتعلق بالفهم والوعي. يُستعمل على نطاق واسع في جميع مستويات اللغة العربية. يعكس أهمية فعل المعرفة في الحياة اليومية والثقافة.",		"English_Context" : "Do ye ken what time it is?",		"English_Info" : "From the Old Norse kenna (“to perceive, recognise”). Scots held onto it long after it faded from standard English, though you’ll still find it lurking in words like kennel (a place dogs are “known”) and uncanny (beyond knowing). Few words wear their Viking ancestry so proudly while still being everyday speech.",		"French" : "savoir",		"French_Context" : "Est-ce que tu ken l'heure qu’il est ?",		"French_Info" : "Issu du vieux norrois kenna (« percevoir, reconnaître »). Les Écossais l’ont conservé bien après sa disparition de l’anglais standard, bien qu’on le retrouve encore dans des mots comme kennel (un endroit où les chiens sont “connus”) et uncanny (au-delà de ce qui est connu). Peu de mots affichent aussi fièrement leur ascendance viking tout en restant d’usage courant.",		"Japanese" : "知る",		"Japanese_Context" : "何時か ken ていますか。",		"Japanese_Info" : "知るは知識や情報を持っていることを表す重要な動詞です。人や事実を理解していることを示すときに広く使われます。文学や日常会話、教育現場でも頻繁に登場します。日本語学習においても最初期に学ぶ必須の語です。",		"audioScottish" : "Z006.ken.scottish.mp3",		"audioScottishContext" : "Z006.ken.scottishContext.mp3",		"audioScottishSlow" : "Z006.ken.scottishSlow.mp3",		"context" : "Do ye ken what time it is?",		"grammarType" : "verb",		"id" : "Z006",		"ipa" : "/kɛn/",		"meaning" : "to know",		"phonetic" : "ken",		"scottish" : "ken"	},	{		"Arabic" : "جميلة",		"Arabic_Context" : "إنها فتاة bonnie.",		"Arabic_Info" : "كلمة جميلة تُستخدم لوصف شخص أو منظر يبعث على الإعجاب. قد تأتي بمعانٍ أخرى مثل حسن أو رائع بحسب السياق. تظهر كثيرًا في الشعر والحديث اليومي على حد سواء. تضفي شعورًا بالدفء والتقدير البسيط للجمال.",		"English_Context" : "She’s a bonnie lass.",		"English_Info" : "Something pleasing to the eye, whether it's a person, a place, or even an object. Comes from Old French bon (“good”) and bonaire (“gentle, fine”), which slipped into Scots in the 15th century. “A bonnie lass\" to describe a pretty girl or \"the bonnie banks o' Loch Lomond\" to refer to the beautiful shores of that famous loch. ",		"French" : "jolie",		"French_Context" : "C’est une fille bonnie.",		"French_Info" : "Quelque chose de plaisant à l’œil, qu’il s’agisse d’une personne, d’un lieu ou d’un objet. Vient de l’ancien français bon (« bon ») et bonaire (« gentil, élégant »), passé en écossais au XVe siècle. On dit par exemple a bonnie lass pour une jolie fille ou the bonnie banks o’ Loch Lomond pour les rives splendides de ce célèbre loch.",		"Japanese" : "きれいな",		"Japanese_Context" : "彼女は bonnie な娘だ。",		"Japanese_Info" : "きれいなは人や物が美しいと感じられることを表す言葉です。フォーマルでもカジュアルでも広く使われ、肯定的な評価を与えます。女性に対する褒め言葉として非常によく登場します。物や風景に対しても自然に使える便利な表現です。",		"audioScottish" : "Z007.bonnie.scottish.mp3",		"audioScottishContext" : "Z007.bonnie.scottishContext.mp3",		"audioScottishSlow" : "Z007.bonnie.scottishSlow.mp3",		"context" : "She’s a bonnie lass.",		"grammarType" : "adjective",		"id" : "Z007",		"ipa" : "/ˈbɔni/",		"meaning" : "pretty",		"phonetic" : "bon-nee",		"scottish" : "bonnie"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "Stop haivering and get on with it!",		"English_Info" : "The word likely comes from Scots haver, linked to Old Norse hafra (“to chatter or gabble”). By the 18th century it was a staple insult across Lowland Scots. Spellings shift between haver, haiver, haver, or the plural haivers, meaning “nonsense” itself (“Dinna talk haivers!”).",		"French" : "dire des bêtises",		"French_Context" : "",		"French_Info" : "Le mot vient probablement de l’écossais haver, lié au vieux norrois hafra (« bavarder, jacasser »). Au XVIIIe siècle, c’était déjà une insulte courante dans les Lowlands. L’orthographe varie : haver, haiver ou haivers, désignant directement des « âneries » (Dinna talk haivers !).",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z008.haiver.scottish.mp3",		"audioScottishContext" : "Z008.haiver.scottishContext.mp3",		"audioScottishSlow" : "Z008.haiver.scottishSlow.mp3",		"context" : "Stop haivering and get on with it!",		"grammarType" : "verb",		"id" : "Z008",		"ipa" : "/ˈheːvər/ ~ /ˈhevər/",		"meaning" : "talk nonsense",		"phonetic" : "hay-ver",		"scottish" : "haiver"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "That bin smells mingin’.",		"English_Info" : "Has its roots in Scots slang of the late 20th century, probably borrowed from the Northern English “minge,” linked to Old Norse myngja (to urinate). In Glasgow you’ll hear “mingin,” while in parts of the Highlands it may stretch to “mangin” or “mingin’ rank”. Curiously, in some areas it can also mean very drunk.",		"French" : "dégoûtant",		"French_Context" : "",		"French_Info" : "Issu de l’argot écossais de la fin du XXe siècle, probablement emprunté à l’anglais du Nord minge, lié au vieux norrois myngja (« uriner »). À Glasgow on dit mingin, tandis que dans certaines régions des Highlands cela devient mangin ou mingin’ rank. Curieusement, dans certaines zones, il peut aussi signifier très ivre.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z009.mingin.scottish.mp3",		"audioScottishContext" : "Z009.mingin.scottishContext.mp3",		"audioScottishSlow" : "Z009.mingin.scottishSlow.mp3",		"context" : "That bin smells mingin’.",		"grammarType" : "adjective",		"id" : "Z009",		"ipa" : "/ˈmɪŋɪn/",		"meaning" : "disgusting",		"phonetic" : "ming-in",		"scottish" : "mingin"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "That’s a muckle sandwich!",		"English_Info" : "Dates back to Old English micel and Old Norse mykill, both meaning large. Spellings vary: “mickle,” “meikle,” and even “moikle” in some dialects. Quirky fact: Tolkien borrowed “mickle” for Middle-earth, giving Scots a quiet cameo in The Lord of the Rings.",		"French" : "grand",		"French_Context" : "",		"French_Info" : "Remonte à l’ancien anglais micel et au vieux norrois mykill, tous deux signifiant grand. Variantes : mickle, meikle ou même moikle selon les dialectes. Anecdote : Tolkien a repris mickle pour la Terre du Milieu, offrant ainsi un discret clin d’œil écossais au Seigneur des Anneaux.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z010.muckle.scottish.mp3",		"audioScottishContext" : "Z010.muckle.scottishContext.mp3",		"audioScottishSlow" : "Z010.muckle.scottishSlow.mp3",		"context" : "That’s a muckle sandwich!",		"grammarType" : "adjective",		"id" : "Z010",		"ipa" : "/ˈmʌkəl/",		"meaning" : "big",		"phonetic" : "muck-ul",		"scottish" : "muckle"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "very small",		"English_Info" : "Comes from the older Scots tot or tottie, meaning a small child or lump. itself from Old English tota (“something small, a jot”). It’s often spelled toaty, toatie, or totie, depending on the region. It’s an affectionate word, often used with “wee” for extra emphasis—“a toaty wee bit”. ",		"French" : "très petit",		"French_Context" : "",		"French_Info" : "Dérive de l’ancien écossais tot ou tottie (« petit enfant, petite chose »), lui-même issu de l’ancien anglais tota (« une broutille, une petite quantité »). On l’écrit souvent toaty, toatie ou totie. C’est un terme affectueux, fréquemment combiné avec wee pour renforcer la petitesse : a toaty wee bit.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z011.totie.scottish.mp3",		"audioScottishContext" : "Z011.totie.scottishContext.mp3",		"audioScottishSlow" : "Z011.totie.scottishSlow.mp3",		"context" : "very small",		"grammarType" : "adjective",		"id" : "Z011",		"ipa" : "/ˈtoːti/",		"meaning" : "very small",		"phonetic" : "toe-tay",		"scottish" : "totie"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "Give it a wee shoogle and see if it works.",		"English_Info" : "Likely comes from the Middle English shog (to jog or push). It’s been a favourite in Scots speech since the 18th century, often used when something’s not quite steady — “that chair’s a bit shoogly”. Spellings vary: shoogle, shoagle, or shogle, depending on region. In Glasgow you might “gie it a shoogle,” while in Fife a shoogly peg warns of shaky ground. ",		"French" : "secouer ou vaciller",		"French_Context" : "",		"French_Info" : "Viendrait du moyen anglais shog (« secouer, pousser »). C’est un mot courant en écossais depuis le XVIIIe siècle, utilisé quand quelque chose n’est pas très stable : « that chair’s a bit shoogly » (cette chaise est bancale). Les orthographes varient : shoogle, shoagle ou shogle. À Glasgow on « gie it a shoogle », tandis qu’à Fife un shoogly peg avertit d’une situation précaire.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z012.shoogle.scottish.mp3",		"audioScottishContext" : "Z012.shoogle.scottishContext.mp3",		"audioScottishSlow" : "Z012.shoogle.scottishSlow.mp3",		"context" : "Give it a wee shoogle and see if it works.",		"grammarType" : "verb",		"id" : "Z012",		"ipa" : "/ˈʃuːɡəl/",		"meaning" : "shake or wobble",		"phonetic" : "shoo-gull",		"scottish" : "shoogle"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "He’s always crabbit in the mornings.",		"English_Info" : "Its roots likely lie in Old Norse krabba(to claw or pinch), hinting at someone whose mood is as scratchy as a crab. Variants like crabbity, crabit. Few words capture a scowl so perfectly. If someone’s crabbit, steer clear — they’re bad-tempered, irritable, and likely to snap at the smallest thing.",		"French" : "grincheux, de mauvaise humeur",		"French_Context" : "",		"French_Info" : "Probablement issu du vieux norrois krabba (« pincer »), suggérant une humeur grincheuse comme un crabe. Variantes : crabbity, crabit. Si quelqu’un est crabbit, méfiez-vous : il est de mauvaise humeur, irritable et prêt à s’emporter pour un rien.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z013.crabbit.scottish.mp3",		"audioScottishContext" : "Z013.crabbit.scottishContext.mp3",		"audioScottishSlow" : "Z013.crabbit.scottishSlow.mp3",		"context" : "He’s always crabbit in the mornings.",		"grammarType" : "adjective",		"id" : "Z013",		"ipa" : "/ˈkrabɪt/",		"meaning" : "grumpy, bad-tempered",		"phonetic" : "crab-it",		"scottish" : "crabbit"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "He gave me a sleekit smile.",		"English_Info" : "Can describe a person or an animal, who is sly, crafty, or deceptively smooth. Comes from Old Norse slíkja (to smooth or make sleek). First recorded in Scots in the 15th century, it can be spelled sleekit, sleeket, or sleeikit depending on dialect. In Glasgow, a “sleekit chancer” is a smooth talker, while in the northeast it might describe a cat out on a night prowl.",		"French" : "sournois",		"French_Context" : "",		"French_Info" : "Peut désigner une personne ou un animal sournois, rusé ou faussement lisse. Vient du vieux norrois slíkja (« lisser »). Attesté en écossais dès le XVe siècle, orthographié sleekit, sleeket ou sleeikit. À Glasgow, un sleekit chancer est un beau parleur ; dans le nord-est, le mot peut qualifier un chat en maraude nocturne.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z014.sleekit.scottish.mp3",		"audioScottishContext" : "Z014.sleekit.scottishContext.mp3",		"audioScottishSlow" : "Z014.sleekit.scottishSlow.mp3",		"context" : "He gave me a sleekit smile.",		"grammarType" : "adjective",		"id" : "Z014",		"ipa" : "/ˈslikɪt/",		"meaning" : "sly, sneaky",		"phonetic" : "slee-kit",		"scottish" : "sleekit"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "That smell geez me the boak.",		"English_Info" : "One of those brilliantly blunt Scots words that almost makes you heave just saying it. The word appears in Scots from the 15th century, likely from Old Norse bákr (“sickness”) or Middle English boken (“to belch or retch”). Spellings vary: boke, bauk, boak, and even bauch in older texts. Across Scotland, it can be used literally (“That smell made me boak”) or figuratively (“His patter fair gied me the boak”).",		"French" : "vomir",		"French_Context" : "",		"French_Info" : "Un de ces mots écossais crus qui donnent presque la nausée rien qu’en le prononçant. Il apparaît dès le XVe siècle, probablement du vieux norrois bákr (« maladie ») ou du moyen anglais boken (« roter, vomir »). Variantes : boke, bauk, boak. En Écosse, on l’emploie littéralement (« cette odeur m’a fait vomir ») ou figurativement (« son baratin m’a donné le boak »)",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z015.boak.scottish.mp3",		"audioScottishContext" : "Z015.boak.scottishContext.mp3",		"audioScottishSlow" : "Z015.boak.scottishSlow.mp3",		"context" : "That smell geez me the boak.",		"grammarType" : "verb",		"id" : "Z015",		"ipa" : "/bok/ ~ /bɔk/",		"meaning" : "to vomit",		"phonetic" : "boh-k",		"scottish" : "boak"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "Sit on yer bahookie!",		"English_Info" : "A playful term for the buttocks, often used with affectionate humour rather than insult. Its origins are hazy, can be traced to 19th-century Scots slang, possibly blending behind with a humorous diminutive ending like -ookie. Spellings shift—bahookie, bahoochie, or even bahoukie—depending on region and whim. If there’s a more descriptive way to describe the rear end, we’ve yet to find it.",		"French" : "fesses",		"French_Context" : "",		"French_Info" : "Terme humoristique pour désigner les fesses, utilisé plus affectueusement qu’insultant. Origines floues, probablement de l’argot écossais du XIXe siècle, combinant behind avec un suffixe comique comme -ookie. Orthographes : bahookie, bahoochie, bahoukie. Façon imagée et drôle de parler du postérieur.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z016.bahookie.scottish.mp3",		"audioScottishContext" : "Z016.bahookie.scottishContext.mp3",		"audioScottishSlow" : "Z016.bahookie.scottishSlow.mp3",		"context" : "Sit on yer bahookie!",		"grammarType" : "noun",		"id" : "Z016",		"ipa" : "/bəˈhuːki/",		"meaning" : "buttocks",		"phonetic" : "ba-hoo-key",		"scottish" : "bahookie"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "Let’s coorie in by the fire.",		"English_Info" : "Its roots lie in the Scots verb cower or curry (to bend or stoop), with Old French and Norse echoes in the background. Spellings shift between coorie, coory, and courie, depending on region. Traditionally, it meant huddling against the cold—“coorie in by the fire”. Think warm woollen blankets, roaring fires, and steaming cups of tea – or something a little stronger!",		"French" : "se blottir",		"French_Context" : "",		"French_Info" : "Dérive du verbe écossais cower ou curry (« se recroqueviller, s’abriter »), avec des échos de l’ancien français et du norrois. Orthographes : coorie, coory, courie. Traditionnellement, cela signifiait se blottir contre le froid : coorie in by the fire. Évoque couvertures de laine, feu de cheminée et tasses fumantes.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z017.coorie.scottish.mp3",		"audioScottishContext" : "Z017.coorie.scottishContext.mp3",		"audioScottishSlow" : "Z017.coorie.scottishSlow.mp3",		"context" : "Let’s coorie in by the fire.",		"grammarType" : "verb",		"id" : "Z017",		"ipa" : "/ˈkuːri/",		"meaning" : "snuggle ",		"phonetic" : "coo-ree",		"scottish" : "coorie"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "Where’s the cludgie?",		"English_Info" : "A wonderfully cheeky term for a toilet, especially an outdoor one. Its origins are debated—some link it to the old Scots cludgie meaning a filthy place or midden, while others suggest roots in clod (dirt) or clud(cloud), hinting at something enclosed. Spellings vary from cludgie to cludgy or cludgey, depending on region. ",		"French" : "toilettes",		"French_Context" : "",		"French_Info" : "Terme familier pour désigner les toilettes, surtout extérieures. Origines débattues : certains le relient à l’ancien écossais cludgie (« lieu sale, dépotoir »), d’autres à clod (terre) ou clud (nuage), suggérant un endroit clos. Orthographes : cludgie, cludgy, cludgey.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z018.cludgie.scottish.mp3",		"audioScottishContext" : "Z018.cludgie.scottishContext.mp3",		"audioScottishSlow" : "Z018.cludgie.scottishSlow.mp3",		"context" : "Where’s the cludgie?",		"grammarType" : "noun",		"id" : "Z018",		"ipa" : "/ˈklʌdʒi/",		"meaning" : "toilet",		"phonetic" : "klud-jee",		"scottish" : "cludgie"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "She’s got three bairns.",		"English_Info" : "Its roots stretch back over a thousand years to Old English bearn and Old Norse barn, both meaning offspring. Spellings vary—bairn, barn, or bearn—with some regions, like the northeast, preferring bairnie. It’s still widely used in Scotland, showing how Viking influence lingered. Burns used it fondly in his poems. Quirkily, astronauts Neil Armstrong and Buzz Aldrin were once dubbed “the first bairns on the moon” in a Scottish newspaper headline.",		"French" : "enfant",		"French_Context" : "",		"French_Info" : "Remonte à l’ancien anglais bearn et au vieux norrois barn, tous deux signifiant « enfant ». Variantes : bairn, barn, bearn. Toujours très courant en Écosse, preuve de l’influence viking persistante. Burns l’utilisait avec tendresse dans ses poèmes. Anecdote : un journal écossais avait surnommé Armstrong et Aldrin « les premiers bairns sur la lune ».",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z019.bairn.scottish.mp3",		"audioScottishContext" : "Z019.bairn.scottishContext.mp3",		"audioScottishSlow" : "Z019.bairn.scottishSlow.mp3",		"context" : "She’s got three bairns.",		"grammarType" : "noun",		"id" : "Z019",		"ipa" : "/bɛːrn/",		"meaning" : "child",		"phonetic" : "bay-ern",		"scottish" : "bairn"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "Don’t be such an eejit!",		"English_Info" : "Its etymology is simple—it’s just “idiot” filtered through a broad accent—but the charm lies in its delivery. Spellings vary: eejit, ejit, eegit, even eejat. Quirkily, it’s rarely cruel; more often it’s affectionate teasing. Stand-up comics and sitcoms have kept it alive, proving that calling someone daft can be oddly endearing.",		"French" : "idiot",		"French_Context" : "",		"French_Info" : "Étymologie simple : c’est « idiot » prononcé avec un fort accent, mais son charme vient de la manière. Variantes : eejit, ejit, eegit. Rarement cruel ; c’est le plus souvent une taquinerie affectueuse. Les humoristes et sitcoms l’ont popularisé, montrant que traiter quelqu’un de sot peut rester attendrissant.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z020.eejit.scottish.mp3",		"audioScottishContext" : "Z020.eejit.scottishContext.mp3",		"audioScottishSlow" : "Z020.eejit.scottishSlow.mp3",		"context" : "Don’t be such an eejit!",		"grammarType" : "noun",		"id" : "Z020",		"ipa" : "/ˈiːdʒɪt/",		"meaning" : "idiot",		"phonetic" : "ee-jit",		"scottish" : "eejit"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "Your t-shirt is clarty!",		"English_Info" : "Comes from Middle English clart (to smear or daub). Its cousins appear in Old Norse kleistra (to stick) and Dutch kladderen (to make a mess). Spellings vary: clarty, clartie, clartae, or even clorty in some dialects. It’s often said with a smile—muddy bairns are “happy clarties”.",		"French" : "sale",		"French_Context" : "",		"French_Info" : "Vient du moyen anglais clart (« barbouiller »). Apparentés : vieux norrois kleistra (« coller ») et néerlandais kladderen (« faire une saleté »). Variantes : clarty, clartie, clartae, clorty. Souvent dit avec humour : des enfants couverts de boue sont des happy clarties.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z021.clarty.scottish.mp3",		"audioScottishContext" : "Z021.clarty.scottishContext.mp3",		"audioScottishSlow" : "Z021.clarty.scottishSlow.mp3",		"context" : "Your t-shirt is clarty!",		"grammarType" : "adjective",		"id" : "Z021",		"ipa" : "/ˈklɑrtɪ/",		"meaning" : "dirty",		"phonetic" : "clar-tee",		"scottish" : "clarty"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "Haud yer wheest.",		"English_Info" : "Thought to be imitative, echoing the sound of someone shushing. First recorded in the 15th century, it pops up in spellings like wheesht, whisht, or wheischt, varying by region. In Glasgow, folk say “Haud yer wheesht,” while in Aberdeenshire it’s often “Wheesht noo.” Curiously, it’s not always stern—sometimes it’s affectionate, like calming a bairn. ",		"French" : "tais-toi",		"French_Context" : "",		"French_Info" : "Probablement onomatopéique, imitant un chuchotement. Attesté dès le XVe siècle, avec des orthographes comme wheesht, whisht, wheischt. À Glasgow on dit « Haud yer wheesht », tandis qu’en Aberdeenshire c’est « Wheesht noo ». Ce n’est pas toujours sévère : parfois c’est tendre, comme pour calmer un enfant.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z022.wheest.scottish.mp3",		"audioScottishContext" : "Z022.wheest.scottishContext.mp3",		"audioScottishSlow" : "Z022.wheest.scottishSlow.mp3",		"context" : "Haud yer wheest.",		"grammarType" : "interjection",		"id" : "Z022",		"ipa" : "/ʍiːʃt/",		"meaning" : "be quiet",		"phonetic" : "wheest",		"scottish" : "wheest"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "There’s a wee beastie on the wall.",		"English_Info" : "A diminutive of beast, from Old French beste and Latin bestia. In Scots, though, it’s less fierce and more affectionate, often meaning a small creature or insect. Spellings shift—beastie, beestie, or beestee—depending on region. Robert Burns made it famous with his line “Wee, sleekit, cow’rin, tim’rous beastie,” immortalising the humble field mouse. In the Highlands, a “wee beastie” might be a midge, dreaded by campers.",		"French" : "petite bête",		"French_Context" : "",		"French_Info" : "Diminutif de beast, de l’ancien français beste et du latin bestia. En écossais, il est moins menaçant et plus affectueux, désignant souvent une petite créature ou un insecte. Variantes : beastie, beestie. Robert Burns l’a rendu célèbre avec « Wee, sleekit, cow’rin, tim’rous beastie », immortalisant la souris des champs.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z023.beastie.scottish.mp3",		"audioScottishContext" : "Z023.beastie.scottishContext.mp3",		"audioScottishSlow" : "Z023.beastie.scottishSlow.mp3",		"context" : "There’s a wee beastie on the wall.",		"grammarType" : "noun",		"id" : "Z023",		"ipa" : "/ˈbiːsti/",		"meaning" : "small creature",		"phonetic" : "bee-stee",		"scottish" : "beastie"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "What a fankle!",		"English_Info" : "Means a tangle, muddle, or confusion—whether it’s shoelaces, wool, or life itself. It likely comes from Old Norse fang (to grasp, catch), evolving through Scots into fank (a sheep pen) and then fankle, something caught up or entwined. Spellings include fankle, fankel, or fankill. Whether describing shoelaces or situations, fankle is a fantastically versatile bit of language.",		"French" : "enchevêtrement ou désordre",		"French_Context" : "",		"French_Info" : "Signifie un enchevêtrement, un désordre ou une confusion — qu’il s’agisse de lacets, de laine ou de la vie elle-même. Vient probablement du vieux norrois fang (« saisir »), passé en écossais fank (« enclos à moutons »), puis fankle. Variantes : fankle, fankel. Utilisé aussi bien pour les choses que pour les situations embrouillées.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z024.fankle.scottish.mp3",		"audioScottishContext" : "Z024.fankle.scottishContext.mp3",		"audioScottishSlow" : "Z024.fankle.scottishSlow.mp3",		"context" : "What a fankle!",		"grammarType" : "noun",		"id" : "Z024",		"ipa" : "/ˈfaŋkəl/",		"meaning" : "tangle or mess",		"phonetic" : "fang-kul",		"scottish" : "fankle"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "My auld gran used to say that.",		"English_Info" : "It comes from Old English eald and Old Norse aldr, meaning age. Spellings range from auld to ald or aul’, with pronunciation shifting by region. It lives on in countless phrases—Auld Lang Syne (old long since) being the most famous, sung worldwide at Hogmanay. ",		"French" : "vieux",		"French_Context" : "",		"French_Info" : "Issu de l’ancien anglais eald et du vieux norrois aldr, signifiant âge. Variantes : auld, ald, aul’. On le retrouve dans de nombreuses expressions, la plus célèbre étant Auld Lang Syne (« le bon vieux temps »), chanté dans le monde entier au Nouvel An.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z025.auld.scottish.mp3",		"audioScottishContext" : "Z025.auld.scottishContext.mp3",		"audioScottishSlow" : "Z025.auld.scottishSlow.mp3",		"context" : "My auld gran used to say that.",		"grammarType" : "adjective",		"id" : "Z025",		"ipa" : "/ɔːld/ ~ /ɔld/",		"meaning" : "old",		"phonetic" : "old",		"scottish" : "auld"	},	{		"Arabic" : "",		"Arabic_Context" : "",		"Arabic_Info" : "",		"English_Context" : "A dook in the loch.",		"English_Info" : "Comes from Old English ducan (to duck or dive), closely related to the word duck. Spellings shift between dook, duke, and douk, depending on dialect. Traditionally, children would “dook for apples” at Halloween, while in coastal towns a winter swim is called “a loony dook”.",		"French" : "une baignade",		"French_Context" : "",		"French_Info" : "Vient de l’ancien anglais ducan (« plonger, s’accroupir »), apparenté au mot duck. Variantes : dook, duke, douk. Traditionnellement, les enfants « dookaient » pour des pommes à Halloween ; dans les villes côtières, une baignade hivernale est appelée loony dook.",		"Japanese" : "",		"Japanese_Context" : "",		"Japanese_Info" : "",		"audioScottish" : "Z026.dook.scottish.mp3",		"audioScottishContext" : "Z026.dook.scottishContext.mp3",		"audioScottishSlow" : "Z026.dook.scottishSlow.mp3",		"context" : "A dook in the loch.",		"grammarType" : "noun/verb",		"id" : "Z026",		"ipa" : "/duːk/",		"meaning" : "a dip or swim",		"phonetic" : "dook (like 'book')",		"scottish" : "dook"	}]